jonacappelle/nRF52-BLE-IMU/ble_services/ble_tms.c
        if (p_tms->is_pedo_notif_enabled != notif_enabled)
        {
            p_tms->is_pedo_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_PEDOMETER, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->raw_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_raw_notif_enabled != notif_enabled)
        {
            p_tms->is_raw_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_RAW, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->euler_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_euler_notif_enabled != notif_enabled)
        {
            p_tms->is_euler_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_EULER, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->rot_mat_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_rot_mat_notif_enabled != notif_enabled)
        {
            p_tms->is_rot_mat_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_ROT_MAT, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->heading_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_heading_notif_enabled != notif_enabled)
        {
            p_tms->is_heading_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_HEADING, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else if ( (p_evt_write->handle == p_tms->gravity_handles.cccd_handle) &&
         (p_evt_write->len == 2) )
    {
        bool notif_enabled;

        notif_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (p_tms->is_gravity_notif_enabled != notif_enabled)
        {
            p_tms->is_gravity_notif_enabled = notif_enabled;

            if (p_tms->evt_handler != NULL)
            {
                p_tms->evt_handler(p_tms, BLE_TMS_EVT_NOTIF_GRAVITY, p_evt_write->data, p_evt_write->len);
            }
        }
    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}


static void on_authorize_req(ble_tms_t * p_tms, ble_evt_t * p_ble_evt)
{
    ble_gatts_evt_rw_authorize_request_t * p_evt_rw_authorize_request = &p_ble_evt->evt.gatts_evt.params.authorize_request;
    ret_code_t err_code;

    if (p_evt_rw_authorize_request->type  == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
    {
        NRF_LOG_DEBUG("BLE_GATTS_AUTHORIZE_TYPE_WRITE");

        if (p_evt_rw_authorize_request->request.write.handle == p_tms->config_handles.value_handle)
        {
            ble_gatts_rw_authorize_reply_params_t rw_authorize_reply;
            bool                                  valid_data = true;

            // Check for valid data.
            if(p_evt_rw_authorize_request->request.write.len != sizeof(ble_tms_config_t))
            {
                valid_data = false;
            }
            // else
            // {
            //     ble_tms_config_t * p_config = (ble_tms_config_t *)p_evt_rw_authorize_request->request.write.data;

            //     if ( (p_config->motion_freq_hz      < BLE_TMS_CONFIG_MPUF_MIN)          ||
            //          (p_config->motion_freq_hz      > BLE_TMS_CONFIG_MPUF_MAX) )
            //     {
            //         valid_data = false;
            //     }
            // }

            rw_authorize_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;

            if (valid_data)
            {
                rw_authorize_reply.params.write.update      = 1;
                rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
                rw_authorize_reply.params.write.p_data      = p_evt_rw_authorize_request->request.write.data;
                rw_authorize_reply.params.write.len         = p_evt_rw_authorize_request->request.write.len;
                rw_authorize_reply.params.write.offset      = p_evt_rw_authorize_request->request.write.offset;
            }
            else
            {
                rw_authorize_reply.params.write.update      = 0;
                rw_authorize_reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_WRITE_NOT_PERMITTED;
            }

            err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       &rw_authorize_reply);
            APP_ERROR_CHECK(err_code);

            if ( valid_data && (p_tms->evt_handler != NULL))
            {
                p_tms->evt_handler(p_tms,
                                   BLE_TMS_EVT_CONFIG_RECEIVED,
                                   p_evt_rw_authorize_request->request.write.data,
                                   p_evt_rw_authorize_request->request.write.len);
            }

            NRF_LOG_DEBUG("valid_data %d", valid_data);
        }
    }
}


/**@brief Function for adding tap characteristic.
 *
 * @param[in] p_tms       Motion Service structure.
 * @param[in] p_tms_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t tap_char_add(ble_tms_t * p_tms, const ble_tms_init_t * p_tms_init)
{
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
    ble_tms_tap_t       tap_init = {0};

    memset(&cccd_md, 0, sizeof(cccd_md));

